{
    "name": "Globalization Is Over",
    "symbol": "GlobalizationIsOver",
    "description": "# A Short, Bittersweet Tale of Globalization\n\n\nOnce upon a time, the world was a patchwork of isolated villages. Then came the Age of Discovery, and ships began to weave these patches together with threads of trade and culture. By the 19th century, steam engines and telegraphs stitched the world tighter, ushering in the first golden age of globalization.\n\nBut the fabric was fragile. World War I tore through it, and the Great Depression unraveled the rest. By World War II, global trade had shrunk to a fraction of its former potential—a level never to be recaptured.\n\nAfter the war, nations strove to mend the tapestry. Institutions like the IMF and World Bank acted as new spools, gathering the scattered threads, and trade flourished once again. However, by the early 21st century, the seams began to strain under the weight of inequality and mounting discontent.\n\nThen came Donald Trump, wielding scissors labeled "America First." With decisive snips, he cut into trade agreements, imposed tariffs, and declared a national emergency to protect American workers. His actions frayed alliances and carved gaps that other global players hurried to fill.\n\nAnd so, the world watched as the once-vibrant quilt of globalization transformed into a patchy, weathered blanket—warm in places yet pierced by cold drafts. Even as memories of unity echo in the threads of the past, the future remains unwritten. With each new twist and turn, the next chapter of our global story is left open—waiting for us to shape it anew.\n\nThe journey continues... and only time will reveal where the threads lead.",
    "image": "https://raw.githubusercontent.com/bdt-cryptocurrency/GlobalizationIsOver/refs/heads/main/GlobalizationIsOver.png",
    "external_url": "",
    "attributes": [
      {
        "trait_type": "Theme",
        "value": "Fan Tribute"
      },
      {
        "trait_type": "Edition",
        "value": "Limited"
      }
    ],
    "disclaimer": "This token is a meme project. It is intended solely as a creative tribute and is not meant to mislead or confuse fans into thinking it is an official product. The creators assume no liability for intellectual property claims. Use at your own risk."
  }